{
  "id": 27,
  "title": "Project Ava: Vtuber Model & AI Interface",
  "excerpt": "Development update on Project Ava, featuring custom Vtuber rigging using HTML/Pygame, emotional AI integration via OpenRouter/ChatGPT, and a functional task management system.",
  "category": "project-updates",
  "date": "2025-12-08",
  "author": "Codem",
  "content": "<h2>Project Ava: Custom Vtuber Rigging</h2>\n<p>I decided to create a custom Vtuber model rigging system similar to professional software, specifically for Project Ava.</p>\n<p>This system utilizes a basic HTML interface combined with Pygame running on localhost.</p>\n<p>I designed the model by combining separate images using Krita, giving Ava a full model with a complete range of expressions and idle animations.</p>\n<h3>Technical Implementation</h3>\n<p>Ava's interaction is managed through both a text and audio interface, communicating primarily via HTTP requests on localhost.</p>\n<p>The rigging process was extensive and focused on achieving fluid animations.</p>\n<p>For determining the best emotional state, I leverage OpenRouter to send a conversation history of 10 messages to a ChatGPT 120b model.</p>\n<p>This dedicated emotional model decides the most appropriate emotion to display.</p>\n<h3>Animation & Emotional States</h3>\n<p>The talking animation is precisely timed: it starts when the Text-to-Speech (TTS) begins and concludes when the TTS finishes.</p>\n<p>Emotional animations override the talking animation when they are triggered by the TTS.</p>\n<p>I categorized the emotional states into two types:</p>\n<p>* Strong Emotions (e.g., anger, frustration, sadness, excitement): These persist on the avatar until the next user interaction.</p>\n<p>* Weak Emotions (e.g., nervousness, happiness, surprise): These are temporary and only last for a duration assigned within the TTS playback.</p>\n<p>A key feature is the separation of models. The emotional model generates an assigned emoji that is appended to the main model's output, allowing the main model to focus on accurate conversational responses without managing the avatar's state.</p>\n<h3>Task Management System</h3>\n<p>I also integrated a fully functional to-do list to help me track various tasks.</p>\n<p>Each task includes attributes like long term, short term, a completed boolean, and a priority level which can be low, medium, or high.</p>\n<p>You can <a href='https://codemsportfolio.netlify.app' target='_blank'>check out my portfolio</a> for more details on my other projects.</p>"
}