{
  "id": 28,
  "title": "Project Codem Flow",
  "excerpt": "Introducing Project Codem Flow: a revolutionary concept for programming diagrams using a zoom-based detail system and AI to present the current state and structure of code.",
  "category": "new-projects",
  "date": "2025-12-09",
  "author": "Codem",
  "content": "<p><h2>Project Codem Flow: Revolutionizing Programming Diagrams</h2>-- This is possibly one of the biggest and most important projects I've taken on, one that aims to revolutionize the future of diagrams in programming. I've come up with a concept for a new form of diagram for programmers to use.-- The main problem with diagrams nowadays is that they often seem rather pointless, as you usually end up drawing them yourself on a whiteboard or just generating one using AI if you absolutely have to. There is no real use for them as a programmer while you are developing the code, unless it's an extremely large and theoretical project or for project planning. But what if that changed?-- What if diagrams could actually show you the current state of your code? What if they showed you in different detail levels what different things in it do, but all in one diagram?<h3>Introducing Project Codem Flows</h3>-- Project Codem Flows is a zoom-based detail system that uses local or OpenRouter-based AI and an Abstract Syntax Tree (AST) to extract code and present it as a fully flowed-out diagram. With different conceptual levels in a single diagram, you can see just what your program is actually doing rather than having to trace table it to find out what each thing does.-- Missing a few comments? No problem! You'll be able to quickly regrasp the concept of what your program's functions, classes, modules, or folders of any size were trying to do and get back to it in no time. Summaries are based on the amount of detail you want them in, so you aren't bombarded with information.-- This will most definitely take a while to pull off, but I am already at the first step. I have made a basic React program to divide any given Python program (Add other support later) into functions, classes, and imports, with a 300% zoom canvas and a JSON format for the extracted targets.-- You can <a href='https://codemsportfolio.netlify.app' target='_blank'>check out my portfolio</a> to see more projects.</p>"
}